app/controllers/message_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."to_userid" = ?  ORDER BY created_at DESC  [["to_userid", 1]]
---
  def inbox
    if current_user.present?
      @messages=Message.where(:to_userid=>current_user.id).order('created_at DESC')

INSERT INTO "messages" ("to_userid", "from_userid", "message_content", "subject", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def messageprocess

    if current_user.present?
    @message = Message.new(:to_userid=>params[:message][:to_userid], :from_userid=>current_user.id,:message_content=>params[:message][:message_content], :subject=>params[:message][:subject])

        if @message.save