app/controllers/postcs_controller.rb

SELECT "postcs".* FROM "postcs"
---
  def index
    @postcs = Postc.all