app/controllers/postcs_controller.rb

  def index
    #@user_idfk=current_user.id

    if session_information
    @postcs = Postc.where(user_idfk: current_user.id)
---
SELECT "postcs".* FROM "postcs" WHERE "postcs"."user_idfk" = ?  [["user_idfk", "1"]]

  def show
    @id=params[:id]
    @pics = Picture.where(post_id_fk: @id)
    @reviews=Review.where(post_idfk: @id)
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."post_id_fk" = ?  [["post_id_fk", 8]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."post_idfk" = ?  [["post_idfk", 8]]

  def create
    @postc = Postc.new(postc_params)
    @postc.user_idfk=current_user.id

    @picture=Picture.new(picture_param)

    respond_to do |format|
      if @postc.save
        @picture.post_id_fk=@postc.id
        @picture.save
---
INSERT INTO "postcs" ("post_title", "post_description", "address", "country", "zip", "city", "price", "home_type", "rooms", "baths", "price_type", "user_idfk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pictures" ("image_url", "image2", "image3", "post_id_fk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["image_url", "image1.jpg"], ["image2", "image2.jpg"], ["image3", "image3.jpg"], ["post_id_fk", 8], ["created_at", "2015-05-15 21:02:33.371864"], ["updated_at", "2015-05-15 21:02:33.371864"]]

  def update
    respond_to do |format|
      if @postc.update(postc_params)
---
UPDATE "postcs" SET "post_description" = ?, "updated_at" = ? WHERE "postcs"."id" = ?  [["post_description", "Rockville House"], ["updated_at", "2015-05-08 17:23:59.939056"], ["id", 1]]

  def destroy
    @postc.destroy
---
DELETE FROM "postcs" WHERE "postcs"."id" = ?  [["id", 3]]

    def set_postc
      @postc = Postc.find(params[:id])
---
SELECT  "postcs".* FROM "postcs" WHERE "postcs"."id" = ? LIMIT 1  [["id", 3]]