app/controllers/profile_controller.rb

SELECT "postcs".* FROM "postcs" WHERE "postcs"."user_idfk" = ?  [["user_idfk", 8]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ?  [["user_id", 1]]
---
  def userview
    @id=params[:id]
    @post=Postc.where(:user_idfk=>@id)

    @profile=Profile.where(:user_id=>@id)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(1) FROM "profiles"
---
  def update
      if current_user
          @record=Profile.count(current_user.id)

SELECT COUNT(*) FROM "profiles" WHERE "profiles"."user_id" = ?  [["user_id", 1]]
INSERT INTO "profiles" ("user_name", "user_desc", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "das"], ["user_desc", "dasadssad"], ["user_id", 1], ["created_at", "2015-05-17 19:50:16.637729"], ["updated_at", "2015-05-17 19:50:16.637729"]]
---
  def create2
    @profile = Profile.where(:user_id => current_user.id).count
    if @profile ==0
    @upd=Profile.new( profile_param)
    @upd.user_id=current_user.id

    if @upd.save