app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("post_idfk", "review_desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_idfk", 8], ["review_desc", "Good property"], ["created_at", "2015-05-16 22:53:28.067259"], ["updated_at", "2015-05-16 22:53:28.067259"]]
---
  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save