app/controllers/search_controller.rb

SELECT "postcs".* FROM "postcs" WHERE (zip='20850')
---
  def searchresult

    @loc=params[:search]
   @search=Postc.where("zip='#{@loc}'")